---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
Alignment..::..GetAlignments Method
Alignment Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | GetAlignments(Document) | Returns all alignments in the given document. |
|  | GetAlignments(View) | Returns all alignments visible in the given view. |

# See Also

Alignment Class

Alignment Members

Autodesk.Revit.DB.Infrastructure Namespace